[
    {
        "id": "booki",
        "title": "Booki",
        "coverDesktop": "/assets/booki.png",
        "coverTablet": "/assets/bookitablet.png",
        "coverPhone": "/assets/bookiphone.png",
        "github": "https://fantomia.github.io/booki/",
        "techno": [
            {
                "logo1": "/assets/html.svg",
                "logo2": "/assets/css.svg",
                "objectif": "<strong><em>HTML</strong></em> et <strong><em>CSS</strong></em> a permis de structurer le site tout en assurant une mise en page fluide et responsive grâce à Flexbox."
            }
        ],
        "description": "<strong><em>Booki</em></strong> est une plateforme de réservation d'hébergements où les utilisateurs peuvent consulter des logements disponibles, filtrer selon leurs préférences, et effectuer des réservations en ligne. Le site permet de visualiser les offres, vérifier les disponibilités et réserver facilement."
    },
    {
        "id": "ohmyfood",
        "title": "Ohmyfood",
        "coverDesktop": "/assets/Ohmy1.png",
        "coverTablet": "/assets/ohmyfoodtablet.png",
        "coverPhone": "/assets/ohmyfoodphone.png",
        "github": "https://fantomia.github.io/ohmyfood/",
        "techno": [
            {
                "logo1": "/assets/sass.svg",
                "objectif": "L'utilisation de <strong><em>SCSS</strong></em> a permis d'optimiser et d'organiser le code CSS tout en facilitant l'intégration d'animations et de transitions pour une expérience utilisateur plus fluide et immersive."
            }
        ],
        "description": "<strong><em>Ohmyfood</em></strong> est un site pour un restaurant qui présente le menu, les plats disponibles, et permet de passer des commandes en ligne. L'idée est de proposer une expérience facile pour découvrir les plats et commander directement sur le site, avec un design adapté aux mobiles."
    },
    {
        "id": "printit",
        "title": "Print it",
        "github": "https://fantomia.github.io/print-it/",
        "coverDesktop": "/assets/printit.png",
        "coverTablet": "/assets/printit.png",
        "coverPhone": "/assets/printit.png",
        "techno": [
            {
                "logo1": "/assets/javascript.svg",
                "objectif": "<strong><em>Javascript</strong></em> m'a permis ici d'ajouter une logique interactive pour modifier en temps réel le contenu de manière dynamique."
            }
        ],
        "description": "<strong><em>Print it</em></strong> est un site où les utilisateurs peuvent personnaliser et imprimer des cartes, invitations, et autres documents. Ils peuvent choisir un modèle, ajouter leur propre texte et voir un aperçu avant de passer à l'impression. C'est un outil simple et rapide pour créer des produits personnalisés."
    },
    {
        "id": "kasa",
        "title": "Kasa",
        "github": "https://fantomia.github.io/kasa/",
        "coverDesktop": "/assets/kasa.png",
        "coverTablet": "/assets/kasatablet.png",
        "coverPhone": "/assets/kasaphone.png",
        "techno": [
            {
                "logo1": "/assets/react.svg",
                "objectif": "<strong><em>React</strong></em> a permet de structurer l'application de manière modulaire et réutilisable. React Router a facilité la navigation entre les pages sans rechargement, rendant l'expérience utilisateur plus fluide."
            }
        ],
        "description": "<strong><em>Kasa</em></strong> est une plateforme de location d&#39;appartements développée avec React. L&#39;utilisation des composants React a permis de structurer le code de manière modulaire et réutilisable. React Router a facilité la navigation entre les différentes pages sans rechargement, rendant l&#39;expérience utilisateur plus fluide et performante."
    }
]